zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/Wireless/KW/KW47B42ZB3/KW47B42ZB3_cm33_core1_COMMON.h
/* BTRTU1 - Peripheral instance base addresses */
/** Peripheral BTRTU1 base address */
#define BTRTU1_BASE                              (0xA8009400u)
/** Peripheral BTRTU1 base pointer */
#define BTRTU1                                   ((BTRTU1_Type *)BTRTU1_BASE)
/** Array initializer of BTRTU1 peripheral base addresses */
#define BTRTU1_BASE_ADDRS                        { BTRTU1_BASE }
/** Array initializer of BTRTU1 peripheral base pointers */
#define BTRTU1_BASE_PTRS                         { BTRTU1 }

/* BTU2_REG - Peripheral instance base addresses */
/** Peripheral BTU2_REG base address */
#define BTU2_REG_BASE                            (0xA9020000u)
/** Peripheral BTU2_REG base pointer */
#define BTU2_REG                                 ((BTU2_REG_Type *)BTU2_REG_BASE)
/** Array initializer of BTU2_REG peripheral base addresses */
#define BTU2_REG_BASE_ADDRS                      { BTU2_REG_BASE }
/** Array initializer of BTU2_REG peripheral base pointers */
#define BTU2_REG_BASE_PTRS                       { BTU2_REG }

/* CAN - Peripheral instance base addresses */
/** Peripheral CAN0 base address */
#define CAN0_BASE                                (0xA91BB000u)
/** Peripheral CAN0 base pointer */
#define CAN0                                     ((CAN_Type *)CAN0_BASE)
/** Peripheral CAN1 base address */
#define CAN1_BASE                                (0xA91CF000u)
/** Peripheral CAN1 base pointer */
#define CAN1                                     ((CAN_Type *)CAN1_BASE)
/** Array initializer of CAN peripheral base addresses */
#define CAN_BASE_ADDRS                           { CAN0_BASE, CAN1_BASE }
/** Array initializer of CAN peripheral base pointers */
#define CAN_BASE_PTRS                            { CAN0, CAN1 }

/* CCM32K - Peripheral instance base addresses */
/** Peripheral CCM32K base address */
#define CCM32K_BASE                              (0xA919F000u)
/** Peripheral CCM32K base pointer */
#define CCM32K                                   ((CCM32K_Type *)CCM32K_BASE)
/** Array initializer of CCM32K peripheral base addresses */
#define CCM32K_BASE_ADDRS                        { CCM32K_BASE }
/** Array initializer of CCM32K peripheral base pointers */
#define CCM32K_BASE_PTRS                         { CCM32K }

/* CIU2 - Peripheral instance base addresses */
/** Peripheral CIU2 base address */
#define CIU2_BASE                                (0xA8008000u)
/** Peripheral CIU2 base pointer */
#define CIU2                                     ((CIU2_Type *)CIU2_BASE)
/** Array initializer of CIU2 peripheral base addresses */
#define CIU2_BASE_ADDRS                          { CIU2_BASE }
/** Array initializer of CIU2 peripheral base pointers */
#define CIU2_BASE_PTRS                           { CIU2 }

/* CMC - Peripheral instance base addresses */
/** Peripheral CMC0 base address */
#define CMC0_BASE                                (0xA9181000u)
/** Peripheral CMC0 base pointer */
#define CMC0                                     ((CMC_Type *)CMC0_BASE)
/** Array initializer of CMC peripheral base addresses */
#define CMC_BASE_ADDRS                           { CMC0_BASE }
/** Array initializer of CMC peripheral base pointers */
#define CMC_BASE_PTRS                            { CMC0 }

/* CRC - Peripheral instance base addresses */
/** Peripheral CRC0 base address */
#define CRC0_BASE                                (0xA91A3000u)
/** Peripheral CRC0 base pointer */
#define CRC0                                     ((CRC_Type *)CRC0_BASE)
/** Array initializer of CRC peripheral base addresses */
#define CRC_BASE_ADDRS                           { CRC0_BASE }
/** Array initializer of CRC peripheral base pointers */
#define CRC_BASE_PTRS                            { CRC0 }

/* DMA - Peripheral instance base addresses */
/** Peripheral DMA0 base address */
#define DMA0_BASE                                (0xA9182000u)
/** Peripheral DMA0 base pointer */
#define DMA0                                     ((DMA_Type *)DMA0_BASE)
/** Array initializer of DMA peripheral base addresses */
#define DMA_BASE_ADDRS                           { DMA0_BASE }
/** Array initializer of DMA peripheral base pointers */
#define DMA_BASE_PTRS                            { DMA0 }

/* DSB - Peripheral instance base addresses */
/** Peripheral DSB0 base address */
#define DSB0_BASE                                (0xA91C1000u)
/** Peripheral DSB0 base pointer */
#define DSB0                                     ((DSB_Type *)DSB0_BASE)
/** Array initializer of DSB peripheral base addresses */
#define DSB_BASE_ADDRS                           { DSB0_BASE }
/** Array initializer of DSB peripheral base pointers */
#define DSB_BASE_PTRS                            { DSB0 }

/* ELEMU - Peripheral instance base addresses */
/** Peripheral ELEMUA base address */
#define ELEMUA_BASE                              (0xA91A4000u)
/** Peripheral ELEMUA base pointer */
#define ELEMUA                                   ((ELEMU_Type *)ELEMUA_BASE)
/** Array initializer of ELEMU peripheral base addresses */
#define ELEMU_BASE_ADDRS                         { ELEMUA_BASE }
/** Array initializer of ELEMU peripheral base pointers */
#define ELEMU_BASE_PTRS                          { ELEMUA }

/* EWM - Peripheral instance base addresses */
/** Peripheral EWM0 base address */
#define EWM0_BASE                                (0xA9193000u)
/** Peripheral EWM0 base pointer */
#define EWM0                                     ((EWM_Type *)EWM0_BASE)
/** Array initializer of EWM peripheral base addresses */
#define EWM_BASE_ADDRS                           { EWM0_BASE }
/** Array initializer of EWM peripheral base pointers */
#define EWM_BASE_PTRS                            { EWM0 }

/* FLEXIO - Peripheral instance base addresses */
/** Peripheral FLEXIO0 base address */
#define FLEXIO0_BASE                             (0xA91BA000u)
/** Peripheral FLEXIO0 base pointer */
#define FLEXIO0                                  ((FLEXIO_Type *)FLEXIO0_BASE)
/** Array initializer of FLEXIO peripheral base addresses */
#define FLEXIO_BASE_ADDRS                        { FLEXIO0_BASE }
/** Array initializer of FLEXIO peripheral base pointers */
#define FLEXIO_BASE_PTRS                         { FLEXIO0 }

/* FMU - Peripheral instance base addresses */
/** Peripheral FMU0 base address */
#define FMU0_BASE                                (0xA91A0000u)
/** Peripheral FMU0 base pointer */
#define FMU0                                     ((FMU_Type *)FMU0_BASE)
/** Peripheral RF_FMU base address */
#define RF_FMU_BASE                              (0xA9141000u)
/** Peripheral RF_FMU base pointer */
#define RF_FMU                                   ((FMU_Type *)RF_FMU_BASE)
/** Array initializer of FMU peripheral base addresses */
#define FMU_BASE_ADDRS                           { FMU0_BASE, RF_FMU_BASE }
/** Array initializer of FMU peripheral base pointers */
#define FMU_BASE_PTRS                            { FMU0, RF_FMU }

/* FRO192M - Peripheral instance base addresses */
/** Peripheral FRO192M0 base address */
#define FRO192M0_BASE                            (0xA9140000u)
/** Peripheral FRO192M0 base pointer */
#define FRO192M0                                 ((FRO192M_Type *)FRO192M0_BASE)
/** Array initializer of FRO192M peripheral base addresses */
#define FRO192M_BASE_ADDRS                       { FRO192M0_BASE }
/** Array initializer of FRO192M peripheral base pointers */
#define FRO192M_BASE_PTRS                        { FRO192M0 }

/* GEN4PHY - Peripheral instance base addresses */
/** Peripheral XCVR_2P4GHZ_PHY base address */
#define XCVR_2P4GHZ_PHY_BASE                     (0xA9107600u)
/** Peripheral XCVR_2P4GHZ_PHY base pointer */
#define XCVR_2P4GHZ_PHY                          ((GEN4PHY_Type *)XCVR_2P4GHZ_PHY_BASE)
/** Array initializer of GEN4PHY peripheral base addresses */
#define GEN4PHY_BASE_ADDRS                       { XCVR_2P4GHZ_PHY_BASE }
/** Array initializer of GEN4PHY peripheral base pointers */
#define GEN4PHY_BASE_PTRS                        { XCVR_2P4GHZ_PHY }

/* GENFSK - Peripheral instance base addresses */
/** Peripheral GENFSK base address */
#define GENFSK_BASE                              (0xA9102000u)
/** Peripheral GENFSK base pointer */
#define GENFSK                                   ((GENFSK_Type *)GENFSK_BASE)
/** Array initializer of GENFSK peripheral base addresses */
#define GENFSK_BASE_ADDRS                        { GENFSK_BASE }
/** Array initializer of GENFSK peripheral base pointers */
#define GENFSK_BASE_PTRS                         { GENFSK }

